console.log("***** set timout *****");
//פעולה שאני רוצה שתקרה  עוד שנייה ולא עכשיו
//בעצם פעולה עם השהייה

//פונקציה מובנת של javascript
//אני יוצר משתנה שם לפונקציה ובפונקציה אני  setTimeout שם 
//שזה ההשהיה של הפונקציה

//const 1sec = () => {
//    setTimeout(() => {}, 1000)
//}

//אי אפשר להתחיל במספר אז נעשה את זה בצורה הבאה
console.log("* פונקציה אנונימית ללא שם *");

const sec1 = () => {
    setTimeout(() => { alert("hello world") }, 1000);
    console.log("I am first");
}
//השניות הן במיליסקנד
//כדי לעשות שנייה אחת נרשום 1000 מיליסקנד

//html שמנו את הפונקציה בכפתור שיצרנו במסמך
/* 
הוא קודם כל ידפיס את ההדפסה ואז תיכנס  הפונקציה למרות שמסמך 
נקרא מלמעלה למטה js 
 */

console.log("*פונקציה לא אנונימית*");
//אני יוצר פונקציה 

const printHello = () => {
    aler("hello class");

}
//ופה אני קורא לפונקציה בתוך ההשהיה שהיא תדע על איזה פונקציה מדובר
const sec2 = () => {
    setTimeout(printHello, 2000)
};

//אם הייתי שם אחרי שקראתי לפונקציה סוגריים זה היה מפעיל אותה ישירות וזהו זה מבטל את ההשהייה

/*
const printHello = () => {
    console.log("hello class");

}
 */
//זה היה עובד console.log אם הייתי שם את ב
//ישירות ושוב פעם אחרי ה2 שניות
/*
const sec2 = () => {
setTimeout(printHello(), 2000)
};
*/