//הגדרה/הכרזה של פונקציה
function sayHello(x) {
    console.log("hello " + x);
}

//קריאה/הפעלה של הפונקציה
sayHello("david")

//בעצם בלי הקריאה לפונקציה הפונקציה לא תפעל
sayHello

//חייבים לשים סוגרים כדי להפעיל אותה
//sayHello(x)

//מה שנמצא בתוך הסוגריים נקרא פרמטר/ארגומנט

//פרמטר
// הפרמטר זה כשהפונקציה יכולה לקבל מבחוץ מהמשתמש נתונים
// הוא משתנה שהמשתמש מביא מבחוץ נתוניםxבעצם ה
//sayHello("david")
//davidהשתנה ל xה
//לדוגמא אני מבקש מהמשתמש לשלוח את השם שלו והפונקציה תיקח את הנתונים שהמשתמש שולח ותישתמש בהם בפונקציה

//ארגומנט
//זה הנתונים האמיתיים שהמשתמש ישלח לי מבחוץ
//זה הארגומט זה הנתונים מבחוץ david בדוגמא שלנו 
//פרמטר = ארגומנט
//  david = name

//בעצם הנתונים שהמתכנת מכניסים בפונקציה נקרא פרמטר
//והנתונים שהמשתמש נותן נקרא ארגומט

//אין הגבלה לכמות פרמטרים

//console.log("****************");

/*דוגמא לחיים האישיים:
למה ההסבר דומה?
לבנקאי שמקבל כספים מלקוחות
מבחינת הלקוח הכסף שהוא מעביר לבנקאי יכול להיות כסף להמון מטרות בסכומים שונים: הפקדה לפיקדון,עו"ש,העברה
הכסף מועבר מהלקוח לבנקאי כארגומנט הלקוח מעביר מבחוץ מחוץ למערכת הבנקאית לבנקאי מבפנים

מבחינת הבנקאי הסכום שהלקוח מעביר לא תמיד משנה אלא הוא תמיד מתייחס אליו כפרמטר משימה מוגדרת מראש ע״י המערכת שהוא אמור לטפל בה והפעולות לגביה במסגרת טיפול הבנקאי קבועות וידועות לבנקאי
הוא יודע מה לעשות עם הכסף לפי הדרישה של הבנק לטיפול בכל פעולת לקוח: הפקדה לפיקדון,עו"ש וכו
כל פעולה כזאת תהיה פונקציה שהבנקאי יודע לבצע*/

/*פרמטר וארגומנט זה אותו דבר 
ההבדל ביניהם הוא מאיזה פוזיציה מנסים להגדיר אותם

ובהמשך לדוגמא הקודמת:

ה5000 ש״ח שהלקוח מפקיד מבחינתו הם נקראים משכורת ומבחינת הבנקאי הם נקראים "הפקדה לעו"ש ללקוח" פעולה בנקאית*/
