//////////////////////////// לולאות - loops ///////////////////////////
// לולאות זה קטע קוד שיחזור על עצמו מספר פעמיים מסוים
// יש לנו שתי סוגי לולאות 
// while
// for

//while
// כל סיבוב שלם של לולאה נקראת איטרציה
// ניצור משתה שמתחיל מ-0
// ונגיד ללולאה שכל עוד המספר קטן מ100 תגדיל אותו כל פעם באחד
//console ואחרי שאתה מעלה אותו באחד תדפיס אותו ב

let myNumber = 0;
while (myNumber < 100) {
    myNumber++;
    console.log(myNumber);

}
//נקבל בהדפסה
//1
//2
//3
//4
//5
//וכו....

console.log('******************************');

//אם רוצים לעשות את אותו הדבר אבל הפעם אני אבחר בין 5 - 10 אבל אני רוצה שיכלול את שתיהם אם נעשה את זה בצורה הבאה כמו שעשינו לפני הוא ישר יקפיץ את ההדפסה הראשונית באחד בעצם אנחנו לא נקבל את ה5 אנחנו נקבל ישר 6
//let myNumber = 5;
//while (myNumber <= 10)
//myNumber++;
//console.log(myNumber);
// כדי שזה ידפיס לנו את ה5 ואז יעלה  נעשה את זה בצורה הבאה

let myNumber2 = 5;
while (myNumber2 <= 10) {
    console.log(myNumber2);
    myNumber2++;
}
// ++ בעצם קודם כל הדפסה ואז מגדיל 

//אופציה שנייה
//let myNumber2 = 4;
//while (myNumber2 <= 10) {
//myNumber2++;
//console.log(myNumber2);
//}

//אם לא נעלה אותו באחד כל פעם זה יתקע לנו את הדפדפן כי הוא אף פעם לא יגיע ל10
//הוא ימשיך להריץ את הפונקציה אינסוף
//let myNumber2 = 5;
//while (myNumber2 <= 10) {
//console.log(myNumber2);
//}

console.log('*************** ex1 ***********');

let ex1 = 1;
while (ex1 <= 10) {
    console.log(ex1);
    ex1++;
}

console.log('**************** ex2 ************');

let ex2 = 2;
while (ex2 <= 7) {
    console.log(ex2);
    ex2++;
}

console.log('************** ex3 ***************');

let ex3 = 10;
while (ex3 >= 0) {
    console.log(ex3);
    ex3--;
}

console.log('***************** ex4 *************');

let ex4 = 8;
while (ex4 >= 3) {
    console.log(ex4);
    ex4--;
}

// כדי לעשות את זה בקפיצות של 2 בעצם קפיצות זוגיות נעשה את זה בצורה הבאה
console.log('******************* ex5 ***********');

let ex5 = 2
while (ex5 <= 20) {
    console.log(ex5);

    ex5 += 2;
}
